app/Controllers/Cadastros.php

SELECT *
FROM `cadastros`
---
        public function index()
        {
            //Chamar uma view que exibe todas as categorias
            $cadastroModel = new \App\Models\CadastroModel();
            $data['cadastros'] = $cadastroModel->find();

INSERT INTO `cadastro` (`nome`, `telefone`, `email`) VALUES ('Lucas de Luca Leocadio', '(16)99316-1812', 'lucasdeluca007@gmail.com')
---
        public function inserir()
        {
            $data['titulo'] = 'Inserir novo cadastro';
            $data['acao'] = 'Inserir';
            $data['msg'] = '';

            if($this->request->getMethod() ==='post'){
                $cadastroModel = new \App\Models\CadastroModel();
                $cadastroModel->set('nome', $this->request->getPost('nome'));
                $cadastroModel->set('telefone', $this->request->getPost('telefone'));
                $cadastroModel->set('email', $this->request->getPost('email'));

                if($cadastroModel->insert()){

SELECT *
FROM `cadastro`
WHERE `cadastro`.`id` = '33'
UPDATE `cadastro` SET `nome` = 'Lucas de Luca Leocadio', `telefone` = '(16)99316-1812', `email` = 'mendonca@gmail.com'
WHERE `cadastro`.`id` IN ('33')
---
        public function editar($id)
        {
            $data['titulo'] = 'Editar cadastro ' . $id;
            $data['acao'] = 'Editar';
            $data['msg'] = '';
            $cadastroModel = new \App\Models\CadastroModel();
            $cadastro = $cadastroModel->find($id);

            if($this->request->getMethod() === 'post'){
                //quando o form for submetido
                $cadastro->nome = $this->request->getPost('nome');
                $cadastro->telefone = $this->request->getPost('telefone');
                $cadastro->email = $this->request->getPost('email');

                if($cadastroModel->update($id, $cadastro)){

DELETE FROM `cadastro`
WHERE `id` IN ('33')
---
       public function excluir($id)
       {
        $data['titulo'] = 'excluir cadastro ' . $id;
        $data['acao'] = 'Excluir';
        $data['msg'] = '';
        $cadastroModel = new \App\Models\CadastroModel();
        if($cadastroModel->delete($id)){